In [63]:
# Now using the new dataset csv file
import pandas as pd
df = pd.read_csv("new_dataset.csv")
df.head(5)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (R),Age
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,1970-01-01 00:00:00.000143207,25.0,30.0
1,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,1970-01-01 00:00:00.000142712,459.0,28.0
2,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,1970-01-01 00:00:00.000181156,1762.5,36.0
3,T7,C7126560,1992-01-26,F,MUMBAI,973.46,2016-02-08,1970-01-01 00:00:00.000173806,566.0,32.0
4,T8,C1220223,1982-01-27,M,MUMBAI,95075.54,2016-02-08,1970-01-01 00:00:00.000170537,148.0,42.0

In [64]:
# View details about the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950938 entries, 0 to 950937
Data columns (total 10 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   TransactionID          950938 non-null  object
 1   CustomerID             950938 non-null  object
 2   CustomerDOB            950938 non-null  object
 3   CustGender             950052 non-null  object
 4   CustLocation           950827 non-null  object
 5   CustAccountBalance     950938 non-null  float64
 6   TransactionDate        950938 non-null  object
 7   TransactionTime        950938 non-null  object
 8   TransactionAmount (R)  950938 non-null  float64
 9   Age                    950938 non-null  float64
dtypes: float64(3), object(7)
memory usage: 72.6+ MB

In [65]:
# Rename columns
df['Gender'] = df['CustGender']
df['Location'] = df['CustLocation']
df['AccountBalance'] = df['CustAccountBalance']
df.drop(columns=['CustGender', 'CustAccountBalance', 'CustLocation'], inplace=True)

# Fix data types
df['AccountBalance'] = df['AccountBalance'].astype(int)
df['TransactionTime'] = pd.to_datetime(df['TransactionTime'])
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'], format="%Y-%m-%d")
df['CustomerDOB'] =  pd.to_datetime(df['CustomerDOB'], format="%Y-%m-%d")

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950938 entries, 0 to 950937
Data columns (total 10 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   TransactionID          950938 non-null  object
 1   CustomerID             950938 non-null  object
 2   CustomerDOB            950938 non-null  datetime64[ns]
 3   TransactionDate        950938 non-null  datetime64[ns]
 4   TransactionTime        950938 non-null  datetime64[ns]
 5   TransactionAmount (R)  950938 non-null  float64
 6   Age                    950938 non-null  float64
 7   Gender                 950052 non-null  object
 8   Location               950827 non-null  object
 9   AccountBalance         950938 non-null  int32
dtypes: datetime64[ns](3), float64(2), int32(1), object(4)
memory usage: 68.9+ MB

In [67]:
df.head(5)

,TransactionID,CustomerID,CustomerDOB,TransactionDate,TransactionTime,TransactionAmount (R),Age,Gender,Location,AccountBalance
0,T1,C5841053,1994-10-01,2016-02-08,1970-01-01 00:00:00.000143207,25.0,30.0,F,JAMSHEDPUR,17819
1,T3,C4417068,1996-11-26,2016-02-08,1970-01-01 00:00:00.000142712,459.0,28.0,F,MUMBAI,17874
2,T5,C9031234,1988-03-24,2016-02-08,1970-01-01 00:00:00.000181156,1762.5,36.0,F,NAVI MUMBAI,6714
3,T7,C7126560,1992-01-26,2016-02-08,1970-01-01 00:00:00.000173806,566.0,32.0,F,MUMBAI,973
4,T8,C1220223,1982-01-27,2016-02-08,1970-01-01 00:00:00.000170537,148.0,42.0,M,MUMBAI,95075

In [68]:
# Check N/A
df.isna().sum()

TransactionID              0
CustomerID                 0
CustomerDOB                0
TransactionDate            0
TransactionTime            0
TransactionAmount (R)      0
Age                        0
Gender                   886
Location                 111
AccountBalance             0
dtype: int64

In [69]:
# Check duplicates
# df.duplicated().sum()
# There are 0 zero, no need to run command.

df[df['Gender'].isna()].head(5)

,TransactionID,CustomerID,CustomerDOB,TransactionDate,TransactionTime,TransactionAmount (R),Age,Gender,Location,AccountBalance
163,T177,C5698953,1800-01-01,2016-12-08,1970-01-01 00:00:00.000155727,3449.00,224.0,NaN,NAVI MUMBAI,8512
1968,T2125,C4525944,1800-01-01,2016-10-21,1970-01-01 00:00:00.000201052,584.06,224.0,NaN,BANGALORE,7115
4601,T5062,C7541851,1800-01-01,2016-09-22,1970-01-01 00:00:00.000061227,1500.00,224.0,NaN,MUMBAI,10669
11828,T13036,C3788162,1800-01-01,2016-09-26,1970-01-01 00:00:00.000210819,336.52,224.0,NaN,MULUND WEST,65989
13515,T14879,C6239153,1800-01-01,2016-09-26,1970-01-01 00:00:00.000163122,1494.00,224.0,NaN,NAVI MUMBAI,603

In [74]:
# Drop rows where Gender = NaN and where Location is NaN
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 949941 entries, 0 to 950937
Data columns (total 10 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   TransactionID          949941 non-null  object
 1   CustomerID             949941 non-null  object
 2   CustomerDOB            949941 non-null  datetime64[ns]
 3   TransactionDate        949941 non-null  datetime64[ns]
 4   TransactionTime        949941 non-null  datetime64[ns]
 5   TransactionAmount (R)  949941 non-null  float64
 6   Age                    949941 non-null  float64
 7   Gender                 949941 non-null  object
 8   Location               949941 non-null  object
 9   AccountBalance         949941 non-null  int32
dtypes: datetime64[ns](3), float64(2), int32(1), object(4)
memory usage: 76.1+ MB

In [75]:
## Feature Engineering